//
//  NewsScrollView.swift
//  arviciRaDavarqva
//
//  Created by Tamuna Kakhidze on 22.05.24.
//

import SwiftUI

struct NewsScrollView: View {
    var body: some View {
        ScrollView {
            VStack() {
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
                
                ScrollItem(
                    title: "რა დაუწუნა ბარბარემ ნიკის?",
                    description: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"
                )
            
                
            }.foregroundColor(.white)
        }
    }
}

struct ScrollItem: View {
    let title: String
    let description: String
    var body: some View {
        HStack(spacing: 17) {
            Image("labelForNews")
            VStack(alignment: .leading) {
                Text(title)
                    .bold()
                    .font(.system(size: 14))
                    
                Text(description)
                    .font(.system(size: 10))
                    .foregroundStyle(Color.gray)
            }
            .frame(
                width: 256
            )
            Spacer()
            
        }
        .padding(.leading, 17)
        
        Divider()
            .background(Color.gray.opacity(1))
    }
    
    
}

#Preview {
    NewsScrollView()
}
